books/haskell-math/ch5.org
#+SETUPFILE: ./math.orgsetup
#+PROPERTY: tangle src/ch5.hs

* Chapter 5: Relations
:PROPERTIES:
:HTML_CONTAINER: section
:END:
  # Tangle with C-c C-x v t   (org-babel-tangle)
  #   or with F6

  #+BEGIN_SRC haskell
    module CH5 where

    import Data.List
    import SetOrd
  #+END_SRC

  A /relation/ is a Set of ordered pairs.

    $(x,y) \in R$   where /R/ is a relation.

  Usually annotated as /xRy/, /R(x,y)/, or /Rxy/.

  The set consisting of all first coordinates of pairs in /R/, is
  called the /domain/ of /R/:
  \begin{equation}
  dom(R) = \left\{ x \vert \exists y (xRy) \right\}
  \end{equation}


  The /range/ is given by:
  \begin{equation}
  ran(R) = \left\{ y \vert \exists x (xRy) \right\}
  \end{equation}

  The /identity/ relation on /A/:
  \begin{equation}
  \Delta_{A} = \left\{ (a,b) \in A^2 |  a = b \right\} = \left\{ (a,a) \vert \in A \right\}
  \end{equation}

  Given a relation, /R/, between /A/ and /B/, the /inverse/ of /R/ is:
  \begin{equation}
  R^{-1} = \left\{ (b,a) | aRb \right\}
  \end{equation}

** Properties of Relations

   A relation /R/ is *reflexive* on /A/ if for every $x \in A: xRx$.

   A relation /R/ on /A/ is *irreflexive* if for no $x \in A: xRx$.
   For example, the relation \lt on $\mathbb{N}$ is irreflexive.

   A relation /R/ on /A/ is *symmetric* if for all $x,y \in A$: if $xRy$ then $yRx$.

   A relation /R/ on /A/ is *asymmetric* if for all $x,y \in A$: if $xRy$ then not $yRx$.
   The relation < on $\mathbb{N}$ is asymmetric.

   A relation /R/ on /A/ is asymmetric iff $R \cap R^{-1} = \emptyset$

   A relation /R/ on /A/ is *antisymmetric* if for all $x,y \in A$: if $xRy$ and $yRx$ then $x = y$.

   | reflexivity    | $\forall x   ~ xRx$                                 |
   | irreflexivity  | $\forall x   ~ \neg xRx$                            |
   | symmetry       | $\forall xy  ~ (xRy \Rightarrow yRx)$               |
   | asymmetry      | $\forall xy  ~ (xRy \Rightarrow \neg yRx)$          |
   | antisymmetry   | $\forall xy  ~ (xRy \land yRx \Rightarrow x = y)$   |
   | transitivity   | $\forall xyz ~ (xRy \land yRz \Rightarrow xRz)$     |
   | intransitivity | $\forall xyz ~ (xRy \land yRz \Rightarrow \neg xRz$ |
   | linearity      | $\forall xy  ~ (xRy \lor yRx \lor x = y)$           |

   A relation /R/ on /A/ is *pre-order* if /R/ is transitive and reflexive.

   A relation /R/ on /A/ is *strict partial order* if /R/ is transitive and irreflexive.
   A relation /R/ on /A/ is *partial order* if /R/ is transitive, reflexive, and antisymmetric.

