books/haskell-math/ch5.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<!-- 2015-02-23 Mon 20:49 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Toby Tripp">
<link rel="stylesheet" href="/programming-notes/stylesheets/styles.css">
<link rel="stylesheet" href="/programming-notes/stylesheets/pygment_trac.css">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
</head>
<body>
<div id="wrapper">
<h1 class="title"></h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Chapter 5: Relations</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900;">CH5</span> <span style="color: #859900; font-weight: bold;">where</span>

<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900;">Data.List</span>
<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900;">SetOrd</span>
</pre>
</div>

<p>
A <i>relation</i> is a Set of ordered pairs.
</p>

<p>
\((x,y) \in R\)   where <i>R</i> is a relation.
</p>

<p>
Usually annotated as <i>xRy</i>, <i>R(x,y)</i>, or <i>Rxy</i>.
</p>

<p>
The set consisting of all first coordinates of pairs in <i>R</i>, is
called the <i>domain</i> of <i>R</i>:
</p>
\begin{equation}
dom(R) = \left\{ x \vert \exists y (xRy) \right\}
\end{equation}


<p>
The <i>range</i> is given by:
</p>
\begin{equation}
ran(R) = \left\{ y \vert \exists x (xRy) \right\}
\end{equation}

<p>
The <i>identity</i> relation on <i>A</i>:
</p>
\begin{equation}
\Delta_{A} = \left\{ (a,b) \in A^2 |  a = b \right\} = \left\{ (a,a) \vert \in A \right\}
\end{equation}

<p>
Given a relation, <i>R</i>, between <i>A</i> and <i>B</i>, the <i>inverse</i> of <i>R</i> is:
</p>
\begin{equation}
R^{-1} = \left\{ (b,a) | aRb \right\}
\end{equation}
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Properties of Relations</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A relation <i>R</i> is <b>reflexive</b> on <i>A</i> if for every \(x \in A: xRx\).
</p>

<p>
A relation <i>R</i> on <i>A</i> is <b>irreflexive</b> if for no \(x \in A: xRx\).
For example, the relation &lt; on \(\mathbb{N}\) is irreflexive.
</p>

<p>
A relation <i>R</i> on <i>A</i> is <b>symmetric</b> if for all \(x,y \in A\): if \(xRy\) then \(yRx\).
</p>

<p>
A relation <i>R</i> on <i>A</i> is <b>asymmetric</b> if for all \(x,y \in A\): if \(xRy\) then not \(yRx\).
The relation &lt; on \(\mathbb{N}\) is asymmetric.
</p>

<p>
A relation <i>R</i> on <i>A</i> is asymmetric iff \(R \cap R^{-1} = \emptyset\)
</p>

<p>
A relation <i>R</i> on <i>A</i> is <b>antisymmetric</b> if for all \(x,y \in A\): if \(xRy\) and \(yRx\) then \(x = y\).
</p>

<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">reflexivity</td>
<td class="left">\(\forall x   ~ xRx\)</td>
</tr>

<tr>
<td class="left">irreflexivity</td>
<td class="left">\(\forall x   ~ \neg xRx\)</td>
</tr>

<tr>
<td class="left">symmetry</td>
<td class="left">\(\forall xy  ~ (xRy \Rightarrow yRx)\)</td>
</tr>

<tr>
<td class="left">asymmetry</td>
<td class="left">\(\forall xy  ~ (xRy \Rightarrow \neg yRx)\)</td>
</tr>

<tr>
<td class="left">antisymmetry</td>
<td class="left">\(\forall xy  ~ (xRy \land yRx \Rightarrow x = y)\)</td>
</tr>

<tr>
<td class="left">transitivity</td>
<td class="left">\(\forall xyz ~ (xRy \land yRz \Rightarrow xRz)\)</td>
</tr>

<tr>
<td class="left">intransitivity</td>
<td class="left">\(\forall xyz ~ (xRy \land yRz \Rightarrow \neg xRz\)</td>
</tr>

<tr>
<td class="left">linearity</td>
<td class="left">\(\forall xy  ~ (xRy \lor yRx \lor x = y)\)</td>
</tr>
</tbody>
</table>

<p>
A relation <i>R</i> on <i>A</i> is <b>pre-order</b> if <i>R</i> is transitive and reflexive.
</p>

<p>
A relation <i>R</i> on <i>A</i> is <b>strict partial order</b> if <i>R</i> is transitive and irreflexive.
A relation <i>R</i> on <i>A</i> is <b>partial order</b> if <i>R</i> is transitive, reflexive, and antisymmetric.
</p>
</div>
</div>
