books/haskell-math/ch5.org
** Relations as Sets of Pairs

   =ys@(y:ys')= allows =ys= to refer to the non-empty list (y:ys').

   #+BEGIN_SRC haskell :tangle src/SetOrd.hs
     module SetOrd
         ( Set(..), emptySet, isEmpty, inSet, subSet, insertSet, deleteSet, powerSet, takeSet, (!!!), list2set, unionSet
         ) where

     import Data.List (sort)

     {-- Sets implemented as ordered lists without duplicates --}

     newtype Set a = Set [a] deriving (Eq, Ord)

     instance (Show a) => Show (Set a) where
       showsPrec _ (Set s) str = showSet s str

     showSet [] str = showString "{}" str
     showSet (x:xs) str = showChar '{' (shows x (show1 xs str))
       where show1 [] str = showChar '}' str
             show1 (x:xs) str = showChar ',' (shows x (show1 xs str))

     emptySet :: Set a
     emptySet = Set []

     isEmpty :: Set a -> Bool
     isEmpty (Set []) = True
     isEmpty _ = False

     inSet :: (Ord a) => a -> Set a -> Bool
     inSet x (Set s) = elem x (takeWhile (<= x) s)

     subSet :: (Ord a) => Set a -> Set a -> Bool
     subSet (Set []) _ = True
     subSet (Set (x:xs)) set = (inSet x set) && subSet (Set xs) set

     insertSet :: (Ord a) => a -> Set a -> Set a
     insertSet x (Set s) = Set (insertList x s)

     insertList x [] = [x]
     insertList x ys@ (y:ys') = case compare x y of
                                 GT -> y : insertList x ys'
                                 EQ -> ys
                                 _ -> x : ys

     deleteSet :: Ord a => a -> Set a -> Set a
     deleteSet x (Set s) = Set (deleteList x s)

     deleteList x [] = []
     deleteList x ys@ (y:ys') = case compare x y of
                                 GT -> y : deleteList x ys'
                                 EQ -> ys'
                                 _ -> ys

     list2set :: Ord a => [a] -> Set a
     list2set [] = Set []
     -- list2set (x:xs) = insertSet x (list2set xs)
     list2set xs = Set (foldr insertList [] xs)

     powerSet :: Ord a => Set a -> Set (Set a)
     powerSet (Set xs) =
       Set (sort (map (\xs -> (list2set xs)) (powerList xs)))

     powerList :: [a] -> [[a]]
     powerList [] = [[]]
     powerList (x:xs) = (powerList xs) ++ (map (x:) (powerList xs))

     takeSet :: Eq a => Int -> Set a -> Set a
     takeSet n (Set xs) = Set (take n xs)

     infixl 9 !!!
     (!!!) :: Eq a => Set a -> Int -> a
     (Set xs) !!! n = xs !! n

     unionSet :: (Ord a) => Set a -> Set a -> Set a
     unionSet (Set []) set2 = set2
     unionSet (Set (x:xs)) set2 = insertSet x (unionSet (Set xs) set2)
   #+END_SRC

   Now we can define a type for Relations in terms of Ordered Sets:

   #+BEGIN_SRC haskell
   type Rel a = Set (a,a)
   #+END_SRC

   A Relation's domain:

   #+BEGIN_SRC haskell
     domR :: Ord a => Rel a -> Set a
     domR (Set r) = list2set [x | (x, _) <- r]
   #+END_SRC

   and the range:

   #+BEGIN_SRC haskell
     ranR :: Ord a => Rel a -> Set a
     ranR (Set r) = list2set [y | (_, y) <- r]
   #+END_SRC

   the identity relation $\Delta_A$ over a set /A/:

   #+BEGIN_SRC haskell
     idR :: Ord a => Set a -> Rel a
     idR (Set xs) = Set [(x, x) | x <- xs]
   #+END_SRC

   A function to create an inverse Relation:

   #+BEGIN_SRC haskell
     invR :: Ord a => Rel a -> Rel a
     invR (Set []) = (Set [])
     invR (Set ((x, y):r)) = insertSet (y, x) (invR (Set r))
   #+END_SRC

