books/haskell-math/ch5.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Relations as Sets of Pairs</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>ys@(y:ys')</code> allows <code>ys</code> to refer to the non-empty list (y:ys').
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900;">SetOrd</span>
    <span style="color: #f5deb3;">(</span> <span style="color: #b58900;">Set</span><span style="color: #b58900;">(</span><span style="color: #268bd2;">..</span><span style="color: #b58900;">)</span>, emptySet, isEmpty, inSet, subSet, insertSet, deleteSet, powerSet, takeSet, <span style="color: #b58900;">(</span><span style="color: #268bd2;">!!!</span><span style="color: #b58900;">)</span>, list2set, unionSet
    <span style="color: #f5deb3;">)</span> <span style="color: #859900; font-weight: bold;">where</span>

<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900;">Data.List</span> <span style="color: #f5deb3;">(</span>sort<span style="color: #f5deb3;">)</span>

<span style="color: #586e75;">{-</span><span style="color: #586e75;">- Sets implemented as ordered lists without duplicates --}</span>

<span style="color: #859900; font-weight: bold;">newtype</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[</span>a<span style="color: #f5deb3;">]</span> <span style="color: #859900; font-weight: bold;">deriving</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Eq</span>, <span style="color: #b58900;">Ord</span><span style="color: #f5deb3;">)</span>

<span style="color: #859900; font-weight: bold;">instance</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Show</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Show</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> a<span style="color: #f5deb3;">)</span> <span style="color: #859900; font-weight: bold;">where</span>
  showsPrec <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> s<span style="color: #f5deb3;">)</span> str <span style="color: #268bd2;">=</span> showSet s str

<span style="color: #268bd2;">showSet</span> <span style="color: #f5deb3;">[]</span> str <span style="color: #268bd2;">=</span> showString <span style="color: #2aa198;">"{}"</span> str
<span style="color: #268bd2;">showSet</span> <span style="color: #f5deb3;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #f5deb3;">)</span> str <span style="color: #268bd2;">=</span> showChar <span style="color: #2aa198;">'{'</span> <span style="color: #f5deb3;">(</span>shows x <span style="color: #b58900;">(</span>show1 xs str<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
  <span style="color: #859900; font-weight: bold;">where</span> show1 <span style="color: #f5deb3;">[]</span> str <span style="color: #268bd2;">=</span> showChar <span style="color: #2aa198;">'}'</span> str
        show1 <span style="color: #f5deb3;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #f5deb3;">)</span> str <span style="color: #268bd2;">=</span> showChar <span style="color: #2aa198;">','</span> <span style="color: #f5deb3;">(</span>shows x <span style="color: #b58900;">(</span>show1 xs str<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">emptySet</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">emptySet</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[]</span>

<span style="color: #268bd2;">isEmpty</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Bool</span>
<span style="color: #268bd2;">isEmpty</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">[]</span><span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">True</span>
<span style="color: #268bd2;">isEmpty</span> <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">False</span>

<span style="color: #268bd2;">inSet</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Ord</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Bool</span>
<span style="color: #268bd2;">inSet</span> x <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> s<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> elem x <span style="color: #f5deb3;">(</span>takeWhile <span style="color: #b58900;">(</span><span style="color: #268bd2;">&lt;=</span> x<span style="color: #b58900;">)</span> s<span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">subSet</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Ord</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Bool</span>
<span style="color: #268bd2;">subSet</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">[]</span><span style="color: #f5deb3;">)</span> <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">True</span>
<span style="color: #268bd2;">subSet</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span> set <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">(</span>inSet x set<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">&amp;&amp;</span> subSet <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> set

<span style="color: #268bd2;">insertSet</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Ord</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">insertSet</span> x <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> s<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>insertList x s<span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">insertList</span> x <span style="color: #f5deb3;">[]</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>x<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">insertList</span> x ys<span style="color: #268bd2;">@</span> <span style="color: #f5deb3;">(</span>y<span style="color: #b58900;">:</span>ys'<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #859900; font-weight: bold;">case</span> compare x y <span style="color: #859900; font-weight: bold;">of</span>
                            <span style="color: #b58900;">GT</span> <span style="color: #268bd2;">-&gt;</span> y <span style="color: #b58900;">:</span> insertList x ys'
                            <span style="color: #b58900;">EQ</span> <span style="color: #268bd2;">-&gt;</span> ys
                            <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #268bd2;">-&gt;</span> x <span style="color: #b58900;">:</span> ys

<span style="color: #268bd2;">deleteSet</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Ord</span> a <span style="color: #268bd2;">=&gt;</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">deleteSet</span> x <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> s<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>deleteList x s<span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">deleteList</span> x <span style="color: #f5deb3;">[]</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[]</span>
<span style="color: #268bd2;">deleteList</span> x ys<span style="color: #268bd2;">@</span> <span style="color: #f5deb3;">(</span>y<span style="color: #b58900;">:</span>ys'<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #859900; font-weight: bold;">case</span> compare x y <span style="color: #859900; font-weight: bold;">of</span>
                            <span style="color: #b58900;">GT</span> <span style="color: #268bd2;">-&gt;</span> y <span style="color: #b58900;">:</span> deleteList x ys'
                            <span style="color: #b58900;">EQ</span> <span style="color: #268bd2;">-&gt;</span> ys'
                            <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #268bd2;">-&gt;</span> ys

<span style="color: #268bd2;">list2set</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Ord</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #f5deb3;">[</span>a<span style="color: #f5deb3;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">list2set</span> <span style="color: #f5deb3;">[]</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[]</span>
<span style="color: #586e75;">-- </span><span style="color: #586e75;">list2set (x:xs) = insertSet x (list2set xs)</span>
<span style="color: #268bd2;">list2set</span> xs <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>foldr insertList <span style="color: #b58900;">[]</span> xs<span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">powerSet</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Ord</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> a<span style="color: #f5deb3;">)</span>
<span style="color: #268bd2;">powerSet</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span>
  <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>sort <span style="color: #b58900;">(</span>map <span style="color: #268bd2;">(</span><span style="color: #268bd2;">\</span>xs <span style="color: #268bd2;">-&gt;</span> <span style="color: #dc322f;">(</span>list2set xs<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>powerList xs<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">powerList</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">[</span>a<span style="color: #f5deb3;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">[</span>a<span style="color: #b58900;">]</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">powerList</span> <span style="color: #f5deb3;">[]</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">[]</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">powerList</span> <span style="color: #f5deb3;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">(</span>powerList xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">++</span> <span style="color: #f5deb3;">(</span>map <span style="color: #b58900;">(</span>x<span style="color: #b58900;">:</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>powerList xs<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">takeSet</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Int</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">takeSet</span> n <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>take n xs<span style="color: #f5deb3;">)</span>

<span style="color: #859900; font-weight: bold;">infixl</span> 9 <span style="color: #268bd2;">!!!</span>
<span style="color: #f5deb3;">(</span><span style="color: #268bd2;">!!!</span><span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Int</span> <span style="color: #268bd2;">-&gt;</span> a
<span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">!!!</span> n <span style="color: #268bd2;">=</span> xs <span style="color: #268bd2;">!!</span> n

<span style="color: #268bd2;">unionSet</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Ord</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">unionSet</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">[]</span><span style="color: #f5deb3;">)</span> set2 <span style="color: #268bd2;">=</span> set2
<span style="color: #268bd2;">unionSet</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span> set2 <span style="color: #268bd2;">=</span> insertSet x <span style="color: #f5deb3;">(</span>unionSet <span style="color: #b58900;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #b58900;">)</span> set2<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Now we can define a type for Relations in terms of Ordered Sets:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">Rel</span> a <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>a,a<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
A Relation's domain:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">domR</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Ord</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Rel</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">domR</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> r<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> list2set <span style="color: #f5deb3;">[</span>x <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span>x, <span style="color: #859900; font-weight: bold;">_</span><span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> r<span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
and the range:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">ranR</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Ord</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Rel</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">ranR</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> r<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> list2set <span style="color: #f5deb3;">[</span>y <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">_</span>, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> r<span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
the identity relation \(\Delta_A\) over a set <i>A</i>:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">idR</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Ord</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Rel</span> a
<span style="color: #268bd2;">idR</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, x<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> x <span style="color: #268bd2;">&lt;-</span> xs<span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
A function to create an inverse Relation:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">invR</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Ord</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Rel</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Rel</span> a
<span style="color: #268bd2;">invR</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">[]</span><span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">[]</span><span style="color: #f5deb3;">)</span>
<span style="color: #268bd2;">invR</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>x, y<span style="color: #268bd2;">)</span><span style="color: #b58900;">:</span>r<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> insertSet <span style="color: #f5deb3;">(</span>y, x<span style="color: #f5deb3;">)</span> <span style="color: #f5deb3;">(</span>invR <span style="color: #b58900;">(</span><span style="color: #b58900;">Set</span> r<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
