books/haskell-math/ch5.org
** Implementing Relations as Functions

   The property of dividing the number 102, giving the set:
   \begin{equation}
   \left\{ d \in \mathbb{N}^{+} | ~ d \mbox{ divides } 102 \right\} = \left\{ 1, 2, 3, 6, 17, 34, 51, 102 \right\}
   \end{equation}

   #+BEGIN_SRC haskell
     divides :: Integer -> Integer -> Bool
     divides d n | d == 0 = error "divides: zero divisor"
                 | otherwise = (rem n d) == 0
   #+END_SRC

   =(`divides` 102)= can be used as shorthand for =flip divides 102= where flip can be defined as:

   #+BEGIN_SRC haskell :tangle no
     flip :: (a -> b -> c) -> b -> a -> c
     flip f x y = f y x
   #+END_SRC

   #+BEGIN_SRC haskell :tangle no
     filter (`divides` 102) [1..300]
   #+END_SRC

   #+BEGIN_SRC haskell
     type Rel' a = a -> a -> Bool

     emptyR' :: Rel' a
     emptyR' = \ _ _ -> False

     list2rel' :: Eq a => [(a, a)] -> Rel' a
     list2rel' xys = \ x y -> elem (x, y) xys
   #+END_SRC

   Composition:

   #+BEGIN_SRC haskell
     compR' :: [a] -> Rel' a -> Rel' a -> Rel' a
     compR' xs r s x y = or [r x z && s z y | z <- xs]
   #+END_SRC
