books/haskell-math/ch5.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Implementing Relations as Functions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The property of dividing the number 102, giving the set:
</p>
\begin{equation}
\left\{ d \in \mathbb{N}^{+} | ~ d \mbox{ divides } 102 \right\} = \left\{ 1, 2, 3, 6, 17, 34, 51, 102 \right\}
\end{equation}

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">divides</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Integer</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Integer</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Bool</span>
<span style="color: #268bd2;">divides</span> d n <span style="color: #268bd2;">|</span> d <span style="color: #268bd2;">==</span> 0 <span style="color: #268bd2;">=</span> error <span style="color: #2aa198;">"divides: zero divisor"</span>
            <span style="color: #268bd2;">|</span> otherwise <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">(</span>rem n d<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">==</span> 0
</pre>
</div>

<p>
<code>(`divides` 102)</code> can be used as shorthand for <code>flip divides 102</code> where flip can be defined as:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">flip</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">(</span>a <span style="color: #268bd2;">-&gt;</span> b <span style="color: #268bd2;">-&gt;</span> c<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">-&gt;</span> b <span style="color: #268bd2;">-&gt;</span> a <span style="color: #268bd2;">-&gt;</span> c
<span style="color: #268bd2;">flip</span> f x y <span style="color: #268bd2;">=</span> f y x
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">filter</span> <span style="color: #f5deb3;">(</span><span style="color: #268bd2;">`divides`</span> 102<span style="color: #f5deb3;">)</span> <span style="color: #f5deb3;">[</span>1<span style="color: #268bd2;">..</span>300<span style="color: #f5deb3;">]</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">Rel'</span> a <span style="color: #268bd2;">=</span> a <span style="color: #268bd2;">-&gt;</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Bool</span>

<span style="color: #268bd2;">emptyR'</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Rel'</span> a
<span style="color: #268bd2;">emptyR'</span> <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">False</span>

<span style="color: #268bd2;">list2rel'</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>a, a<span style="color: #b58900;">)</span><span style="color: #f5deb3;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Rel'</span> a
<span style="color: #268bd2;">list2rel'</span> xys <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> x y <span style="color: #268bd2;">-&gt;</span> elem <span style="color: #f5deb3;">(</span>x, y<span style="color: #f5deb3;">)</span> xys
</pre>
</div>

<p>
Composition:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">compR'</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">[</span>a<span style="color: #f5deb3;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Rel'</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Rel'</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Rel'</span> a
<span style="color: #268bd2;">compR'</span> xs r s x y <span style="color: #268bd2;">=</span> or <span style="color: #f5deb3;">[</span>r x z <span style="color: #268bd2;">&amp;&amp;</span> s z y <span style="color: #268bd2;">|</span> z <span style="color: #268bd2;">&lt;-</span> xs<span style="color: #f5deb3;">]</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
